In [1]:
import numpy as np
import pandas as pd
import sqlite3

In [2]:
db = sqlite3.connect(r"C:\Users\ankit\Downloads\movies dataset\movies.sqlite")

In [3]:
data = """SELECT * FROM movies"""
movies = pd.read_sql(data,db)
print(movies)

         id                            original_title     budget  popularity  \
0     43597                                    Avatar  237000000         150
1     43598  Pirates of the Caribbean: At World's End  300000000         139
2     43599                                   Spectre  245000000         107
3     43600                     The Dark Knight Rises  250000000         112
4     43601                               John Carter  260000000          43
...     ...                                       ...        ...         ...
4768  48395                               El Mariachi     220000          14
4769  48396                                 Newlyweds       9000           0
4770  48397                 Signed, Sealed, Delivered          0           1
4771  48398                          Shanghai Calling          0           0
4772  48399                         My Date with Drew          0           1

     release_date     revenue                                     title  \
0      2009-12-10  2787965087                                    Avatar
1      2007-05-19   961000000  Pirates of the Caribbean: At World's End
2      2015-10-26   880674609                                   Spectre
3      2012-07-16  1084939099                     The Dark Knight Rises
4      2012-03-07   284139100                               John Carter
...           ...         ...                                       ...
4768   1992-09-04     2040920                               El Mariachi
4769   2011-12-26           0                                 Newlyweds
4770   2013-10-13           0                 Signed, Sealed, Delivered
4771   2012-05-03           0                          Shanghai Calling
4772   2005-08-05           0                         My Date with Drew

      vote_average  vote_count  \
0              7.2       11800
1              6.9        4500
2              6.3        4466
3              7.6        9106
4              6.1        2124
...            ...         ...
4768           6.6         238
4769           5.9           5
4770           7.0           6
4771           5.7           7
4772           6.3          16

                                               overview  \
0     In the 22nd century, a paraplegic Marine is di...
1     Captain Barbossa, long believed to be dead, ha...
2     A cryptic message from Bond’s past sends him o...
3     Following the death of District Attorney Harve...
4     John Carter is a war-weary, former military ca...
...                                                 ...
4768  El Mariachi just wants to play his guitar and ...
4769  A newlywed couple's honeymoon is upended by th...
4770  "Signed, Sealed, Delivered" introduces a dedic...
4771  When ambitious New York attorney Sam is sent t...
4772  Ever since the second grade when he first saw ...

                                                tagline     uid  director_id
0                           Enter the World of Pandora.   19995         4762
1        At the end of the world, the adventure begins.     285         4763
2                                 A Plan No One Escapes  206647         4764
3                                       The Legend Ends   49026         4765
4                  Lost in our world, found in another.   49529         4766
...                                                 ...     ...          ...
4768  He didn't come looking for trouble, but troubl...    9367         5097
4769  A newlywed couple's honeymoon is upended by th...   72766         6485
4770                                               None  231617         7108
4771                           A New Yorker in Shanghai  126186         7109
4772                                               None   25975         7110

[4773 rows x 13 columns]

In [4]:
movies.head()

,id,original_title,budget,popularity,release_date,revenue,title,vote_average,vote_count,overview,tagline,uid,director_id
0,43597,Avatar,237000000,150,2009-12-10,2787965087,Avatar,7.2,11800,"In the 22nd century, a paraplegic Marine is di...",Enter the World of Pandora.,19995,4762
1,43598,Pirates of the Caribbean: At World's End,300000000,139,2007-05-19,961000000,Pirates of the Caribbean: At World's End,6.9,4500,"Captain Barbossa, long believed to be dead, ha...","At the end of the world, the adventure begins.",285,4763
2,43599,Spectre,245000000,107,2015-10-26,880674609,Spectre,6.3,4466,A cryptic message from Bond’s past sends him o...,A Plan No One Escapes,206647,4764
3,43600,The Dark Knight Rises,250000000,112,2012-07-16,1084939099,The Dark Knight Rises,7.6,9106,Following the death of District Attorney Harve...,The Legend Ends,49026,4765
4,43601,John Carter,260000000,43,2012-03-07,284139100,John Carter,6.1,2124,"John Carter is a war-weary, former military ca...","Lost in our world, found in another.",49529,4766

In [5]:
dirs = """SELECT * FROM directors"""
directors = pd.read_sql(dirs, db)
print(directors)

                   name    id  gender      uid department
0         James Cameron  4762       2     2710  Directing
1        Gore Verbinski  4763       2     1704  Directing
2            Sam Mendes  4764       2       39  Directing
3     Christopher Nolan  4765       2      525  Directing
4        Andrew Stanton  4766       2        7  Directing
...                 ...   ...     ...      ...        ...
2344      Shane Carruth  7106       2    76624  Directing
2345   Neill Dela Llana  7107       0  1174437  Directing
2346        Scott Smith  7108       0  1219158  Directing
2347        Daniel Hsia  7109       2   208138  Directing
2348   Brian Herzlinger  7110       2    85563  Directing

[2349 rows x 5 columns]

In [6]:
movies.columns

Index(['id', 'original_title', 'budget', 'popularity', 'release_date',
       'revenue', 'title', 'vote_average', 'vote_count', 'overview', 'tagline',
       'uid', 'director_id'],
      dtype='object')

In [7]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4773 entries, 0 to 4772
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              4773 non-null   int64
 1   original_title  4773 non-null   object
 2   budget          4773 non-null   int64
 3   popularity      4773 non-null   int64
 4   release_date    4773 non-null   object
 5   revenue         4773 non-null   int64
 6   title           4773 non-null   object
 7   vote_average    4773 non-null   float64
 8   vote_count      4773 non-null   int64
 9   overview        4770 non-null   object
 10  tagline         3951 non-null   object
 11  uid             4773 non-null   int64
 12  director_id     4773 non-null   int64
dtypes: float64(1), int64(7), object(5)
memory usage: 484.9+ KB

In [8]:
directors.columns

Index(['name', 'id', 'gender', 'uid', 'department'], dtype='object')

In [9]:
directors.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2349 entries, 0 to 2348
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        2349 non-null   object
 1   id          2349 non-null   int64
 2   gender      2349 non-null   int64
 3   uid         2349 non-null   int64
 4   department  2349 non-null   object
dtypes: int64(3), object(2)
memory usage: 91.9+ KB

In [10]:
directors.isnull().sum()

name          0
id            0
gender        0
uid           0
department    0
dtype: int64

In [11]:
movies.isnull().sum()

id                  0
original_title      0
budget              0
popularity          0
release_date        0
revenue             0
title               0
vote_average        0
vote_count          0
overview            3
tagline           822
uid                 0
director_id         0
dtype: int64

In [12]:
movies = """SELECT COUNT(*) AS no_of_movies FROM movies"""
no_of_movies = pd.read_sql(movies, db)
print(no_of_movies)

   no_of_movies
0          4773

In [13]:
directors1 = """SELECT * FROM directors
                WHERE name == 'James Cameron' OR name == 'Andrew Stanton' OR name== 'Scott Smith' """
directors_name = pd.read_sql(directors1, db)
print(directors_name)

             name    id  gender      uid department
0   James Cameron  4762       2     2710  Directing
1  Andrew Stanton  4766       2        7  Directing
2     Scott Smith  7108       0  1219158  Directing

In [14]:
directors2 = """SELECT * FROM directors
                WHERE name LIKE 'James%'"""
James_directors = pd.read_sql(directors2, db)
print(James_directors)

                     name    id  gender      uid department
0           James Cameron  4762       2     2710  Directing
1               James Wan  4794       2     2127  Directing
2              James Gunn  4827       2    15218  Directing
3             James Bobin  4834       0    26205  Directing
4         James L. Brooks  4899       2     3388  Directing
5           James Mangold  4900       2      366  Directing
6             James Algar  5011       2     5690  Directing
7          James McTeigue  5204       2    11266  Directing
8              James Wong  5239       2    57134  Directing
9           James Gartner  5461       2    60496  Directing
10             James Gray  5520       2    20561  Directing
11          James Bridges  5580       2    14838  Directing
12          James Schamus  5742       0     1617  Directing
13            James Ivory  5826       2    54441  Directing
14          James Watkins  5842       0    63306  Directing
15            James Marsh  5847       2    76998  Directing
16            James Foley  5876       2    15890  Directing
17            James Isaac  5927       2    69579  Directing
18            James Fargo  5934       2    66222  Directing
19         James DeMonaco  6057       2    53120  Directing
20          James Frawley  6188       2    68457  Directing
21             James Nunn  6227       0  1088096  Directing
22         James D. Stern  6249       2    52159  Directing
23              James Cox  6339       2    40508  Directing
24           James Toback  6340       2    56381  Directing
25           James Manera  6399       0  1343882  Directing
26        James Melkonian  6460       0    73668  Directing
27            James Whale  6484       2     2917  Directing
28         James Ponsoldt  6607       0   930710  Directing
29           James Dodson  6612       2    61848  Directing
30          James Mottern  6744       0   105313  Directing
31  James David Pasternak  6782       0   233519  Directing
32          James O'Brien  7014       0  1562428  Directing
33           James Kerwin  7030       0  1187357  Directing
34          James Bidgood  7093       0   237393  Directing

In [15]:
directors3 = """SELECT * FROM directors
                WHERE name LIKE '%Smith'"""
_smith_directors = pd.read_sql(directors3, db)
print(_smith_directors)

                     name    id  gender      uid department
0             Kevin Smith  5369       2    19303  Directing
1    Charles Martin Smith  5371       2     1270  Directing
2            Carter Smith  5584       0    68352  Directing
3   Brian Trenchard-Smith  5638       0    84981  Directing
4         Jim Field Smith  5679       2   111686  Directing
5       Christopher Smith  6019       2    41041  Directing
6               Mel Smith  6116       2   141450  Directing
7    Scott Marshall Smith  6126       2    69144  Directing
8             Becky Smith  6843       0   939176  Directing
9              Ryan Smith  6906       0  1100753  Directing
10             Alex Smith  6941       2   641437  Directing
11            Scott Smith  7108       0  1219158  Directing

In [16]:
directors4 = """SELECT * FROM directors
                WHERE name LIKE '%Dela%'"""
_dela_directors = pd.read_sql(directors4, db)
print(_dela_directors)

                name    id  gender      uid department
0  Camille Delamarre  5525       0   928490  Directing
1    Steve Bendelack  5564       2    16356  Directing
2     Youssef Delara  6575       0   930627  Directing
3   Neill Dela Llana  7107       0  1174437  Directing

In [17]:
directors5 = """SELECT COUNT(gender) FROM directors
                WHERE gender == 1"""
female_directors = pd.read_sql(directors5, db)
print(female_directors)

   COUNT(gender)
0            150

In [18]:
directors6 = """SELECT name, uid FROM directors
                WHERE gender ==1
                LIMIT 5"""
female_directors_uid = pd.read_sql(directors6, db)
print(female_directors_uid)

                  name     uid
0       Brenda Chapman   59803
1      Lilly Wachowski    9339
2  Jennifer Yuh Nelson  142312
3      Kathryn Bigelow   14392
4         Nancy Meyers   17698

In [19]:
movies1 = """SELECT original_title, popularity FROM movies
            ORDER BY popularity DESC
            LIMIT 5"""
popular_movies = pd.read_sql(movies1, db)
print(popular_movies)

            original_title  popularity
0                  Minions         875
1             Interstellar         724
2                 Deadpool         514
3  Guardians of the Galaxy         481
4       Mad Max: Fury Road         434

In [20]:
movies2 = """SELECT original_title, budget FROM movies
            ORDER BY budget DESC
            LIMIT 5"""
high_budget_movies = pd.read_sql(movies2, db)
print(high_budget_movies)

                                original_title     budget
0  Pirates of the Caribbean: On Stranger Tides  380000000
1     Pirates of the Caribbean: At World's End  300000000
2                      Avengers: Age of Ultron  280000000
3                             Superman Returns  270000000
4                                  John Carter  260000000

In [21]:
movies3 = """SELECT original_title, revenue FROM movies
            ORDER BY revenue DESC
            LIMIT 5"""
high_revenue_movies = pd.read_sql(movies3, db)
print(high_revenue_movies)

   original_title     revenue
0          Avatar  2787965087
1         Titanic  1845034188
2    The Avengers  1519557910
3  Jurassic World  1513528810
4       Furious 7  1506249360

In [22]:
movies4 = """SELECT original_title, vote_average FROM movies
            ORDER BY vote_average DESC
            LIMIT 5"""
high_vote_average_movies = pd.read_sql(movies4, db)
print(high_vote_average_movies)

             original_title  vote_average
0          Stiff Upper Lips          10.0
1     Dancer, Texas Pop. 81          10.0
2                 Sardaarji           9.5
3            One Man's Hero           9.3
4  The Shawshank Redemption           8.5

In [23]:
movies5 = """SELECT original_title, vote_average FROM movies
            WHERE vote_average BETWEEN 5.0 AND 7.5 
            LIMIT 5"""
vote_average_movies = pd.read_sql(movies5, db)
print(vote_average_movies)

                             original_title  vote_average
0                                    Avatar           7.2
1  Pirates of the Caribbean: At World's End           6.9
2                                   Spectre           6.3
3                               John Carter           6.1
4                              Spider-Man 3           5.9

In [24]:
movies6 = """SELECT original_title, vote_count FROM movies
            ORDER BY vote_count DESC
            LIMIT 5"""
high_vote_count_movies = pd.read_sql(movies6, db)
print(high_vote_count_movies)

    original_title  vote_count
0        Inception       13752
1  The Dark Knight       12002
2           Avatar       11800
3     The Avengers       11776
4         Deadpool       10995

In [25]:
movies7 = """SELECT original_title, vote_count FROM movies
            WHERE vote_count < 3462
            LIMIT 5"""
vote_count_movies = pd.read_sql(movies7, db)
print(vote_count_movies)

      original_title  vote_count
0        John Carter        2124
1            Tangled        3330
2   Superman Returns        1400
3  Quantum of Solace        2965
4    The Lone Ranger        2311

In [26]:
movies8 = """SELECT original_title, tagline FROM movies
            ORDER BY vote_count DESC
            LIMIT 5"""
tagline_of_movies = pd.read_sql(movies8, db)
print(tagline_of_movies)

    original_title                                  tagline
0        Inception     Your mind is the scene of the crime.
1  The Dark Knight                          Why So Serious?
2           Avatar              Enter the World of Pandora.
3     The Avengers                  Some assembly required.
4         Deadpool  Witness the beginning of a happy ending

In [27]:
movies9 = """SELECT release_date, original_title FROM movies
            WHERE release_date > 2007-05-19 
            LIMIT 10"""
movies_dates = pd.read_sql(movies9, db)
print(movies_dates)

  release_date                            original_title
0   2009-12-10                                    Avatar
1   2007-05-19  Pirates of the Caribbean: At World's End
2   2015-10-26                                   Spectre
3   2012-07-16                     The Dark Knight Rises
4   2012-03-07                               John Carter
5   2007-05-01                              Spider-Man 3
6   2010-11-24                                   Tangled
7   2015-04-22                   Avengers: Age of Ultron
8   2009-07-07    Harry Potter and the Half-Blood Prince
9   2016-03-23        Batman v Superman: Dawn of Justice

In [28]:
movies_or_directors1 = """SELECT m.original_title FROM movies AS m
                            JOIN directors AS d
                            ON m.director_id = d.id
                            WHERE name == 'Jim Field Smith'"""
movies_name = pd.read_sql(movies_or_directors1, db)
print(movies_name)

           original_title
0  She's Out of My League

In [29]:
movies_or_directors2 = """SELECT d.name FROM directors AS d
                            JOIN movies AS m
                            ON d.id = m.director_id
                            GROUP BY m.director_id ORDER BY SUM(m.budget) DESC
                            LIMIT 5"""
directors_name = pd.read_sql(movies_or_directors2,db)
print(directors_name)

               name
0  Steven Spielberg
1       Michael Bay
2     Peter Jackson
3      Ridley Scott
4      Bryan Singer

In [30]:
movies_or_directors3 = """SELECT m.original_title, d.name FROM movies AS m
                            JOIN directors AS d
                            ON m.director_id = d.id
                            ORDER BY m.popularity DESC
                            LIMIT 5"""
movies_directors = pd.read_sql(movies_or_directors3, db)
print(movies_directors)

            original_title               name
0                  Minions         Kyle Balda
1             Interstellar  Christopher Nolan
2                 Deadpool         Tim Miller
3  Guardians of the Galaxy         James Gunn
4       Mad Max: Fury Road      George Miller

In [31]:
movies_or_directors4 = """SELECT m.original_title, d.name, m.tagline FROM movies AS m
                            JOIN directors AS d
                            ON m.director_id = d.id
                            ORDER BY m.vote_count DESC
                            LIMIT 5"""
movies_by_vote_count = pd.read_sql(movies_or_directors4, db)
print(movies_by_vote_count)

    original_title               name                                  tagline
0        Inception  Christopher Nolan     Your mind is the scene of the crime.
1  The Dark Knight  Christopher Nolan                          Why So Serious?
2           Avatar      James Cameron              Enter the World of Pandora.
3     The Avengers        Joss Whedon                  Some assembly required.
4         Deadpool         Tim Miller  Witness the beginning of a happy ending

In [32]:
movies_or_directors5 = """SELECT m.original_title, d.name, release_date FROM movies AS m
                            JOIN directors AS d
                            ON m.director_id = d.id
                            WHERE release_date < 2015-10-26
                            LIMIT 5"""
movies_on_release_date = pd.read_sql(movies_or_directors5, db)
print(movies_on_release_date)

         original_title                name release_date
0              Superman      Richard Donner   1978-12-13
1                Lolita     Stanley Kubrick   1962-06-13
2               Солярис    Andrei Tarkovsky   1972-03-20
3  Yours, Mine and Ours  Melville Shavelson   1968-04-24
4             Pinocchio      Ben Sharpsteen   1940-02-23